# vstAddResPDMenuMode

```pascal
PROCEDURE vstAddResPDMenuMode(
				label : STRING;
				value : STRING);
```

```python
def vs.vstAddResPDMenuMode(label, value):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|label|STRING|   |
|value|STRING|   |

## Version
Availability: from Vectorworks 2017

## Category
* Tool Events